import pandas as pd

print('----' * 30)
print('Список работников компании')

data_personal = {
    'ID': ['01', '02', '03', '04', '05'],
    'Имя': ['Иван', 'Петр', 'Евгения', 'Татьяна', 'Николай'],
    'Фамилия': ['Иванов', 'Петров', 'Сидорова', 'Николаева', 'Колюкин'],
    'Дата рождения': ['01.09.1969', '09.01.2001', '11.04.1996', '25.11.1998', '30.03.1974'],
    'Должность': ['Директор', 'Бухгалтер', 'Менеджер', 'Курьер', 'Рабочий']
}

sc = pd.DataFrame(data=data_personal)

with open('personal.csv', 'a', encoding='UTF-8') as cl:
    cl.write(f'{sc}')
    cl.write('\n')

print(sc)